###СЛОВАРИ###

# dict в Python — это неупорядоченная коллекция пар "ключ-значение"
# 1.Хранение пар "ключ-значение":
# Каждый элемент состоит из ключа и соответствующего значения:
{"name": "John", "age": 30}

# 2.Ключи должны быть уникальны:
# Один и тот же ключ не может встречаться дважды.
# Значения могут повторяться.

# 3.Ключи должны быть неизменяемыми:
# Ключами могут быть числа, строки, кортежи, но не списки или словари

# 4.Изменяемость:
# Словари изменяемы — можно добавлять, удалять и изменять элементы